In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = pd.read_csv("titanic.csv")

In [3]:
data.shape

(891, 12)

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [6]:
data.head()

   Survived  Pclass  Gender   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
X = data.iloc[:,1:]

In [8]:
X.head()

   Pclass  Gender   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [11]:
y = data.iloc[:,:1]

In [12]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [15]:
gender = pd.get_dummies(X.Gender,drop_first=True)

In [16]:
gender

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [17]:
X = pd.concat([X,gender],axis=1)

In [18]:
X.head()

   Pclass  Gender   Age     Fare  male
0       3    male  22.0   7.2500     1
1       1  female  38.0  71.2833     0
2       3  female  26.0   7.9250     0
3       1  female  35.0  53.1000     0
4       3    male  35.0   8.0500     1

In [19]:
X.drop(['Gender'],axis=1,inplace=True)

In [20]:
X.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

In [22]:
X.isnull().sum()

Pclass      0
Age       177
Fare        0
male        0
dtype: int64

In [23]:
meanAge = X.Age.mean()

In [24]:
meanAge

29.69911764705882

In [25]:
X.Age = X.Age.fillna(29)

In [27]:
X.isnull().sum()

Pclass    0
Age       0
Fare      0
male      0
dtype: int64

In [33]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2, random_state=45)

In [34]:
from sklearn.naive_bayes import GaussianNB 
model = GaussianNB()

In [35]:
model.fit(X_train, y_train)

C:\Users\Heman\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

GaussianNB()

In [36]:
y_pred = model.predict(X_test)

In [37]:
from sklearn.metrics import accuracy_score
accuracy_score(y_pred,y_test)

0.8100558659217877